Конфигурация/Documents/МНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МНО</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/МНО/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЭтаФорма.ЭтоНовыйДокумент = Истина;
		
		ЗначениеРеквизитовОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "ПометкаУдаления, ВидОперации");
		
		Если ЗначениеРеквизитовОснования.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать документы на основании помеченного на удаление распоряжения!",,,, Отказ);				
		КонецЕсли;
		
		Если ЗначениеРеквизитовОснования.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создать [МНО] на основании распоряжения на размещение кредитного инструмента!",,,, Отказ);		
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
				
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если Не ЭтаФорма.ФлагЕстьСоглашениеМНО Тогда
		РаботаСФормами.ЗаполнитьДополнительныеСвязиИПараметрыВыбора(Элементы.Договор, "СчетДоверительногоУправления,ДатаРасторжения");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Если ЭтаФорма.ЭтоНовыйДокумент Тогда
		ЭтаФорма.ЭтоНовыйДокумент = Ложь;
		
		// для нового проведенного документа подчиненный приход % создается без доп. подтверждения
		Если Объект.Проведен Тогда
			СоздатьПриходПроцентовМНО(Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	ПриходПроцентовМНО = НайтиПодчиненныйПриходПроцентовМНО(Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(ПриходПроцентовМНО) И Объект.Проведен Тогда
		
		Если Вопрос("Создать подчиненный приход % МНО?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СоздатьПриходПроцентовМНО(Объект.Ссылка);
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(ПриходПроцентовМНО) И ПриходПроцентовМНОТребуетСинхронизации(ПриходПроцентовМНО) Тогда
		
		Если Вопрос("Перезаполнить подчиненный приход % МНО на основании новых данных?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ОткрытьФорму("Документ.ПриходПроцентовМНО.ФормаОбъекта", Новый Структура("Ключ, Основание", ПриходПроцентовМНО, Объект.Ссылка));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.Дата);

	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаПриИзменении(Элемент)
	
	ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСервере(Объект.Основание, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСервере(Объект.Основание, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
	КонецЕсли;
	
	ЭтаФорма.ФлагЕстьСоглашениеМНО = ЕстьСоглашениеОМНО(Объект.РасчетныйСчет);
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерПодтвержденияНаСервере(Распоряжение, Организация, СчетДоверительногоУправления, ДатаДок) 
					
	ЗарегистрированныеНомера = РегистрыСведений.НомераОбъектов.ПолучитьЗарегистрированныеНомера(
								Организация,
								Справочники.ВидыНумерацииОбъектов.РаспоряженияНаМНО,
								РаботаСКоллекциями.ЗначениеВМассив(Распоряжение),
								СчетДоверительногоУправления,
								Год(ДатаДок));
	
	Если ЗарегистрированныеНомера <> Неопределено Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(ЗарегистрированныеНомера[Распоряжение]);
	КонецЕсли;
				
КонецФункции

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	Если РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь) Тогда
		
		Если ЗначениеЗаполнено(Объект.Основание) Тогда
			ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСервере(Объект.Основание, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
		КонецЕсли;
		
		НастроитьВидимостьИДоступность(ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.Дата);
	ЭтаФорма.ФлагЕстьСоглашениеМНО = ЕстьСоглашениеОМНО(Объект.РасчетныйСчет);
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСервере(Объект.Основание, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
	КонецЕсли;

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
		
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПриходПроцентовМНО(МНО)
	
	ПриходПроцентовМНО = Документы.ПриходПроцентовМНО.СоздатьДокумент();
	ПриходПроцентовМНО.Заполнить(МНО);
	
	Если Не ПриходПроцентовМНО.ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ прихода процентов по МНО");
		Возврат ПриходПроцентовМНО.Ссылка;
	КонецЕсли;
	
	Попытка
		ПриходПроцентовМНО.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + ПриходПроцентовМНО, ПриходПроцентовМНО.Ссылка);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ прихода процентов по МНО. Система сообщает: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ПриходПроцентовМНО.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПодчиненныйПриходПроцентовМНО(МНО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриходПроцентовМНО.Ссылка
		|ИЗ
		|	Документ.ПриходПроцентовМНО КАК ПриходПроцентовМНО
		|ГДЕ
		|	ПриходПроцентовМНО.МНО = &МНО
		|	И НЕ ПриходПроцентовМНО.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("МНО", МНО);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если      Выборка.Количество() = 0 Тогда
		Возврат Документы.ПриходПроцентовМНО.ПустаяСсылка();
	ИначеЕсли Выборка.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного подчиненного прихода % МНО. Обрабатываться будет только первый из них.");
	КонецЕсли;
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПриходПроцентовМНОТребуетСинхронизации(ПриходПроцентовМНО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПриходПроцентовМНО.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(ПриходПроцентовМНО.МНО.ДатаВозврата, ДЕНЬ)
		|				ИЛИ ПриходПроцентовМНО.Организация <> ПриходПроцентовМНО.МНО.Организация
		|				ИЛИ ПриходПроцентовМНО.СчетДоверительногоУправления <> ПриходПроцентовМНО.МНО.СчетДоверительногоУправления
		|				ИЛИ ПриходПроцентовМНО.РасчетныйСчет <> ПриходПроцентовМНО.МНО.РасчетныйСчет
		|				ИЛИ ПриходПроцентовМНО.СуммаМНО <> ПриходПроцентовМНО.МНО.Сумма
		|				ИЛИ ПриходПроцентовМНО.Сумма <> &СуммаПроцентов
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяСинхронизация
		|ИЗ
		|	Документ.ПриходПроцентовМНО КАК ПриходПроцентовМНО
		|ГДЕ
		|	ПриходПроцентовМНО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 		ПриходПроцентовМНО);
	Запрос.УстановитьПараметр("СуммаПроцентов", РаботаСМНО.РасчетСуммыМНО(ПриходПроцентовМНО.МНО, ПриходПроцентовМНО.МНО.ДатаВозврата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ТребуетсяСинхронизация;

КонецФункции

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	Элементы.ДоговорМНО.Видимость				= Форма.ФлагЕстьСоглашениеМНО;
	Элементы.ГруппаНомерПодтверждения.Видимость	= Форма.ФлагЕстьСоглашениеМНО И ЗначениеЗаполнено(ДанныеОбъекта.Основание);
	
	Если Форма.ФлагЕстьСоглашениеМНО Тогда
		Элементы.ДоговорМНО.Заголовок = "Текущее соглашение о МНО на " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		Элементы.Договор.Заголовок = "Действующее соглашение о МНО";
		Элементы.Договор.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Договор.Гиперссылка = Истина;
	Иначе
		Элементы.Договор.Заголовок = "";
		Элементы.Договор.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;	
		
	СвязиСкрываемыхПолей = Новый Структура();	
	СвязиСкрываемыхПолей.Вставить("Договор", "Объект.Договор");				
	СвязиСкрываемыхПолей.Вставить("ГруппаНомерПодтверждения", "НомерПодтверждения");
	
	РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, СвязиСкрываемыхПолей);	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСоглашениеОМНО(БанковскийСчет)
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "ДоговорМНО"));			
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСервере(Объект.Основание, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

#КонецОбласти
